analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
/*
 * Copyright (c) 2025-2026 Analog Devices, Inc.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include <stdlib.h>
#include <string.h>
#include <errno.h>
#include "stm32_capi_spi_priv.h"
#include "stm32_capi_gpio_priv.h"
#include "capi_alloc.h"
#include "capi_time.h"
#ifdef HAL_TIM_MODULE_ENABLED
#include "capi_timer.h"
#endif

#ifndef max
#define max(a, b) (((a) > (b)) ? (a) : (b))
#endif

#define STM32_SPI_CRC_POLYNOMIAL		10
#define STM32_SPI_DMA_DEFAULT_TIMEOUT_MS	1000
#define STM32_SPI_GPIO_PINS_PER_PORT		16

/* Forward declarations */
static int stm32_capi_spi_dma_abort(struct capi_spi_device *device);

/* lookup table for mapping HAL handles to private handles */
#define MAX_SPI_INSTANCES 8
static struct {
	SPI_HandleTypeDef *hspi;
	struct stm32_spi_priv_handle *priv_handle;
} spi_handle_lookup[MAX_SPI_INSTANCES];
static uint8_t spi_handle_count = 0;

/**
 * @brief Find the private handle associated with a HAL SPI handle.
 * @param hspi - Pointer to the HAL SPI handle.
 * @return Pointer to the private handle, or NULL if not found.
 */
static struct stm32_spi_priv_handle *find_priv_handle(SPI_HandleTypeDef *hspi)
{
	for (uint8_t i = 0; i < spi_handle_count; i++) {
		if (spi_handle_lookup[i].hspi == hspi) {
			return spi_handle_lookup[i].priv_handle;
		}
	}
	return NULL;
}

/**
 * @brief Register a mapping between a HAL SPI handle and a private handle.
 * @param hspi - Pointer to the HAL SPI handle.
 * @param priv_handle - Pointer to the private handle.
 * @return 0 on success, negative error code otherwise.
 */
static int register_handle_mapping(SPI_HandleTypeDef *hspi,
				   struct stm32_spi_priv_handle *priv_handle)
{
	if (spi_handle_count >= MAX_SPI_INSTANCES) {
		return -ENOMEM;
	}

	spi_handle_lookup[spi_handle_count].hspi = hspi;
	spi_handle_lookup[spi_handle_count].priv_handle = priv_handle;
	spi_handle_count++;
	return 0;
}

/**
 * @brief Unregister the mapping for a HAL SPI handle.
 * @param hspi - Pointer to the HAL SPI handle.
 */
static void unregister_handle_mapping(SPI_HandleTypeDef *hspi)
{
	for (uint8_t i = 0; i < spi_handle_count; i++) {
		if (spi_handle_lookup[i].hspi == hspi) {
			/* Move last entry to this position */
			if (i < spi_handle_count - 1) {
				spi_handle_lookup[i] = spi_handle_lookup[spi_handle_count - 1];
			}
			spi_handle_count--;
			break;
		}
	}
}

/**
 * @brief Configure SPI peripheral based on device settings.
 * @param priv_handle - Pointer to the STM32 SPI private handle.
 * @param device - Pointer to the SPI device descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_config_peripheral(struct stm32_spi_priv_handle
		*priv_handle,
		struct capi_spi_device *device)
{
	uint32_t prescaler = 0u;
	int ret = 0;

	/* Verify SPI instance is configured */
	if (!priv_handle->hspi->Instance)
		return -EINVAL;

	/* automatically select prescaler based on max_speed_hz */
	if (device->max_speed_hz != 0u) {
		uint32_t div = priv_handle->input_clock / device->max_speed_hz;

		switch (div) {
		case 0 ... 2:
			prescaler = SPI_BAUDRATEPRESCALER_2;
			break;
		case 3 ... 4:
			prescaler = SPI_BAUDRATEPRESCALER_4;
			break;
		case 5 ... 8:
			prescaler = SPI_BAUDRATEPRESCALER_8;
			break;
		case 9 ... 16:
			prescaler = SPI_BAUDRATEPRESCALER_16;
			break;
		case 17 ... 32:
			prescaler = SPI_BAUDRATEPRESCALER_32;
			break;
		case 33 ... 64:
			prescaler = SPI_BAUDRATEPRESCALER_64;
			break;
		case 65 ... 128:
			prescaler = SPI_BAUDRATEPRESCALER_128;
			break;
		default:
			prescaler = SPI_BAUDRATEPRESCALER_256;
			break;
		}
	} else {
		prescaler = SPI_BAUDRATEPRESCALER_64;
	}

	/* Use the SPI instance that was set during init */
	priv_handle->hspi->Init.Mode = SPI_MODE_MASTER;
	priv_handle->hspi->Init.Direction = SPI_DIRECTION_2LINES;
	priv_handle->hspi->Init.DataSize = SPI_DATASIZE_8BIT;
	priv_handle->hspi->Init.CLKPolarity = device->mode & CAPI_SPI_CPOL ?
					      SPI_POLARITY_HIGH :
					      SPI_POLARITY_LOW;
	priv_handle->hspi->Init.CLKPhase = device->mode & CAPI_SPI_CPHA ?
					   SPI_PHASE_2EDGE :
					   SPI_PHASE_1EDGE;
	priv_handle->hspi->Init.NSS = SPI_NSS_SOFT;
	priv_handle->hspi->Init.BaudRatePrescaler = prescaler;
	priv_handle->hspi->Init.FirstBit = device->lsb_first ?
					   SPI_FIRSTBIT_LSB :
					   SPI_FIRSTBIT_MSB;
	priv_handle->hspi->Init.TIMode = SPI_TIMODE_DISABLE;
	priv_handle->hspi->Init.CRCCalculation = SPI_CRCCALCULATION_DISABLE;
	priv_handle->hspi->Init.CRCPolynomial = STM32_SPI_CRC_POLYNOMIAL;

	ret = HAL_SPI_Init(priv_handle->hspi);
	if (ret != HAL_OK) {
		return -EIO;
	}

#ifdef SPI_SR_TXE
	__HAL_SPI_ENABLE(priv_handle->hspi);
#endif

	return 0;
}

/**
 * @brief Get SPI base address from identifier.
 * @param identifier - SPI peripheral identifier or base address.
 * @return Pointer to the SPI peripheral, or NULL if invalid.
 */
static SPI_TypeDef *get_spi_base_from_identifier(uint64_t identifier)
{
	/* If identifier is a base address, use it directly */
	if (identifier >= PERIPH_BASE) {
		return (SPI_TypeDef *)identifier;
	}

	/* Otherwise, map device ID to base address */
	switch (identifier) {
#if defined(SPI1)
	case 1:
		return SPI1;
#endif
#if defined(SPI2)
	case 2:
		return SPI2;
#endif
#if defined(SPI3)
	case 3:
		return SPI3;
#endif
#if defined(SPI4)
	case 4:
		return SPI4;
#endif
#if defined(SPI5)
	case 5:
		return SPI5;
#endif
#if defined(SPI6)
	case 6:
		return SPI6;
#endif
	default:
		return NULL;
	}
}

/**
 * @brief Initialize the STM32 SPI controller.
 * @param handle - Pointer to store the allocated SPI controller handle.
 * @param config - Pointer to the SPI configuration.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_init(struct capi_spi_controller_handle **handle,
			       const struct capi_spi_config *config)
{
	struct capi_spi_controller_handle *spi_handle;
	struct stm32_spi_priv_handle *spi_priv_handle;
	struct stm32_spi_extra_config *spi_extra_config;
	SPI_TypeDef *base;
	int ret = 0;

	if (!handle || !config || !config->extra)
		return -EINVAL;

	if (*handle == NULL) {
		spi_handle = (struct capi_spi_controller_handle *)capi_calloc(1,
				sizeof(*spi_handle));
		if (!spi_handle)
			return -ENOMEM;

		spi_priv_handle = (struct stm32_spi_priv_handle *)capi_calloc(1,
				  sizeof(*spi_priv_handle));
		if (!spi_priv_handle) {
			capi_free(spi_handle);
			return -ENOMEM;
		}

		spi_handle->priv = spi_priv_handle;
		spi_handle->init_allocated = true;
	} else {
		spi_handle = *handle;
		spi_handle->init_allocated = false;

