analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
		if (!spi_handle->priv)
			return -EINVAL;

		spi_priv_handle = spi_handle->priv;
	}

	spi_handle->ops = config->ops;

	spi_extra_config = config->extra;

	/* Set up SPI instance */
	if (spi_extra_config && spi_extra_config->hspi) {
		/*
		 * Alias the caller's HAL handle - do NOT copy it. IT/DMA transfers
		 * are serviced by the platform NVIC vector (e.g. CubeMX's
		 * SPI1_IRQHandler -> HAL_SPI_IRQHandler(&hspi1)), which acts on the
		 * caller's handle object. Operating on the same object keeps the HAL
		 * state machine and completion-callback routing consistent between
		 * the driver and the ISR.
		 */
		spi_priv_handle->hspi = spi_extra_config->hspi;
	} else {
		/* Auto-configure based on identifier using internal storage. */
		base = get_spi_base_from_identifier(config->identifier);
		if (!base) {
			ret = -EINVAL;
			goto error;
		}
		spi_priv_handle->hspi = &spi_priv_handle->hspi_storage;
		spi_priv_handle->hspi->Instance = base;
	}

	/*
	 * Force the handle into the RESET state so the first HAL_SPI_Init()
	 * runs HAL_SPI_MspInit() (peripheral clock + GPIO + NVIC).
	 *
	 * HAL_SPI_Init() only calls MspInit when State == HAL_SPI_STATE_RESET.
	 * When hspi is copied from a user template (e.g. CubeMX's global, which
	 * boots in the READY state) or reused after a previous deinit, the copy
	 * would otherwise carry a non-RESET state and MspInit would be skipped -
	 * leaving the peripheral clock gated off after a deinit/init cycle and
	 * hanging the first transfer. Family-generic (HAL state machine is
	 * common to all STM32 SPI IPs).
	 */
	spi_priv_handle->hspi->State = HAL_SPI_STATE_RESET;

	/* Initialize other fields */
	spi_priv_handle->callback = NULL;
	spi_priv_handle->callback_arg = NULL;
	spi_priv_handle->current_transfer = NULL;
	spi_priv_handle->async_in_progress = false;
	spi_priv_handle->dma_done = false;
	spi_priv_handle->sync_cfg_cached = false;
	spi_priv_handle->sync_cfg_key = 0;

	if (spi_extra_config) {
		if (spi_extra_config->get_input_clock)
			spi_priv_handle->input_clock = spi_extra_config->get_input_clock();
		else
			spi_priv_handle->input_clock = config->clk_freq_hz;

		spi_priv_handle->alternate = spi_extra_config->alternate;

		/* Set up DMA if provided */
		if (spi_extra_config->dma_handle) {
			spi_priv_handle->dma_handle = spi_extra_config->dma_handle;

			/* Initialize DMA channels if configured */
			if (spi_extra_config->rxdma_ch_id != 0) {
				ret = capi_dma_init_chan(spi_priv_handle->dma_handle,
							 &spi_priv_handle->rxdma_ch,
							 spi_extra_config->rxdma_ch_id);
				if (ret)
					goto error;
			}

			if (spi_extra_config->txdma_ch_id != 0) {
				ret = capi_dma_init_chan(spi_priv_handle->dma_handle,
							 &spi_priv_handle->txdma_ch,
							 spi_extra_config->txdma_ch_id);
				if (ret)
					goto error;
			}
		}

#ifdef HAL_TIM_MODULE_ENABLED
		/* Store timer handles for PWM-based CS/TX control */
		if (spi_extra_config->cs_timer) {
			spi_priv_handle->cs_timer = spi_extra_config->cs_timer;
			spi_priv_handle->cs_timer_channel = spi_extra_config->cs_timer_channel;

			ret = capi_timer_channel_disable(spi_priv_handle->cs_timer,
							 spi_priv_handle->cs_timer_channel);
			if (ret)
				goto error;
		}
		if (spi_extra_config->tx_timer) {
			spi_priv_handle->tx_timer = spi_extra_config->tx_timer;
			spi_priv_handle->tx_timer_channel = spi_extra_config->tx_timer_channel;

			ret = capi_timer_channel_disable(spi_priv_handle->tx_timer,
							 spi_priv_handle->tx_timer_channel);
			if (ret)
				goto error;
		}
#endif
	} else {
		spi_priv_handle->input_clock = config->clk_freq_hz;
	}

	/* Register handle mapping for callbacks */
	ret = register_handle_mapping(spi_priv_handle->hspi, spi_priv_handle);
	if (ret != 0) {
		goto error;
	}

	*handle = spi_handle;
	return 0;

error:
	if (spi_handle->init_allocated) {
		capi_free(spi_priv_handle);
		capi_free(spi_handle);
	}
	return ret;
}

/**
 * @brief Deinitialize the STM32 SPI controller and free resources.
 * @param handle - Pointer to the SPI controller handle.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_deinit(struct capi_spi_controller_handle *handle)
{
	struct stm32_spi_priv_handle *spi_priv_handle;

	if (!handle)
		return -EINVAL;

	spi_priv_handle = handle->priv;

	if (spi_priv_handle) {
#ifdef HAL_TIM_MODULE_ENABLED
		if (spi_priv_handle->cs_timer)
			capi_timer_channel_disable(spi_priv_handle->cs_timer,
						   spi_priv_handle->cs_timer_channel);
		if (spi_priv_handle->tx_timer)
			capi_timer_channel_disable(spi_priv_handle->tx_timer,
						   spi_priv_handle->tx_timer_channel);
#endif

		/* Clean up DMA channels */
		if (spi_priv_handle->rxdma_ch) {
			capi_dma_deinit_chan(spi_priv_handle->rxdma_ch);
			spi_priv_handle->rxdma_ch = NULL;
		}
		if (spi_priv_handle->txdma_ch) {
			capi_dma_deinit_chan(spi_priv_handle->txdma_ch);
			spi_priv_handle->txdma_ch = NULL;
		}

#ifdef SPI_SR_TXE
		__HAL_SPI_DISABLE(spi_priv_handle->hspi);
#endif
		HAL_SPI_DeInit(spi_priv_handle->hspi);

		/* Unregister handle mapping */
		unregister_handle_mapping(spi_priv_handle->hspi);

		/* Clean up CAPI GPIO for CS */
		if (spi_priv_handle->cs_initialized) {
			capi_gpio_port_deinit(&spi_priv_handle->cs_port_handle);
			spi_priv_handle->cs_initialized = false;
		}
	}

	if (handle->init_allocated) {
		capi_free(handle->priv);
		capi_free(handle);
	}

	return 0;
}

/**
 * @brief Setup GPIO CS pin for the device using CAPI GPIO.
 * @param priv_handle - Pointer to the STM32 SPI private handle.
 * @param device - Pointer to the SPI device descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int setup_cs_gpio(struct stm32_spi_priv_handle *priv_handle,
			 struct capi_spi_device *device)
{
	struct stm32_spi_device_extra *dev_extra = device->extra;
	struct capi_gpio_port_config port_config;
	int ret;

	if (!dev_extra || !dev_extra->chip_select_port)
		return 0; /* No CS setup needed */

	/* Skip if already initialized */
	if (priv_handle->cs_initialized)
		return 0;

