analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
	/* Configure GPIO port for CS pin */
	priv_handle->cs_gpio_config.mode = GPIO_MODE_OUTPUT_PP;
	priv_handle->cs_gpio_config.speed = GPIO_SPEED_FREQ_LOW;
	priv_handle->cs_gpio_config.pull = GPIO_NOPULL;
	priv_handle->cs_gpio_config.alternate = 0;

	/* Initialize GPIO port */
	port_config.ops = &stm32_capi_gpio_ops;
	port_config.identifier = dev_extra->chip_select_port;
	port_config.num_pins = STM32_SPI_GPIO_PINS_PER_PORT;
	port_config.flags = NULL;
	port_config.extra = &priv_handle->cs_gpio_config;

	ret = capi_gpio_port_init(&priv_handle->cs_port_handle, &port_config);
	if (ret)
		return ret;

	/* Configure chip select pin */
	priv_handle->chip_select.port_handle = priv_handle->cs_port_handle;
	priv_handle->chip_select.number = dev_extra->chip_select_pin;
	priv_handle->chip_select.flags = CAPI_GPIO_ACTIVE_LOW; /* CS is active low */

	/* Set CS as output */
	ret = capi_gpio_pin_set_direction(&priv_handle->chip_select, CAPI_GPIO_OUTPUT);
	if (ret) {
		capi_gpio_port_deinit(&priv_handle->cs_port_handle);
		return ret;
	}

	/* Set CS high (inactive) - using raw value since ACTIVE_LOW flag is set */
	ret = capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
	if (ret) {
		capi_gpio_port_deinit(&priv_handle->cs_port_handle);
		return ret;
	}

	priv_handle->cs_initialized = true;
	return 0;
}

/**
 * @brief Perform SPI transfer with proper CS control and timing.
 * @param priv_handle - Pointer to the STM32 SPI private handle.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @param assert_cs - Whether to assert CS before transfer.
 * @param deassert_cs - Whether to deassert CS after transfer.
 * @return 0 on success, negative error code otherwise.
 */
static int perform_spi_transfer_with_cs(struct stm32_spi_priv_handle
					*priv_handle,
					struct capi_spi_device *device,
					struct capi_spi_transfer *transfer,
					bool assert_cs, bool deassert_cs)
{
	struct stm32_spi_device_extra *dev_extra = device->extra;
	uint64_t cfg_key;
	int ret = 0;
	HAL_StatusTypeDef hal_ret;

	/*
	 * Reconfigure the peripheral only when the effective device settings
	 * change. The key is stored per-controller (not file-static) so it is
	 * reset by init and a fresh/re-initialized controller always configures
	 * on its first transfer; it also folds in every field config_peripheral
	 * consumes (CS, clock mode, bit order, speed) so a change to any of them
	 * re-applies the config.
	 */
	cfg_key = ((uint64_t)(device->cs_gpio ? device->cs_gpio->number :
			      device->native_cs)) |
		  ((uint64_t)device->mode << 8) |
		  ((uint64_t)(device->lsb_first ? 1U : 0U) << 16) |
		  ((uint64_t)device->max_speed_hz << 32);

	if (!priv_handle->sync_cfg_cached || cfg_key != priv_handle->sync_cfg_key) {
		ret = stm32_capi_spi_config_peripheral(priv_handle, device);
		if (ret)
			return ret;
		priv_handle->sync_cfg_key = cfg_key;
		priv_handle->sync_cfg_cached = true;
	}

	/* Assert CS if requested (drive low for active-low CS) */
	if (assert_cs && priv_handle->cs_initialized) {
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_LOW);
	}

	/* CS delay first */
	if (dev_extra && dev_extra->cs_delay_first) {
		capi_wait_us(dev_extra->cs_delay_first);
	}

	/* Use HAL functions for reliable operation */
	if (transfer->tx_buf && transfer->rx_buf) {
		uint32_t xfer_len = max(transfer->tx_size, transfer->rx_size);
		uint32_t timeout_val = transfer->timeout > 0 ?
				       transfer->timeout : HAL_MAX_DELAY;

		if (transfer->tx_size == transfer->rx_size) {
			hal_ret = HAL_SPI_TransmitReceive(priv_handle->hspi,
							  (uint8_t *)transfer->tx_buf,
							  transfer->rx_buf,
							  xfer_len, timeout_val);
		} else {
			uint8_t *tmp_tx = capi_calloc(1, xfer_len);
			uint8_t *tmp_rx = capi_calloc(1, xfer_len);

			if (!tmp_tx || !tmp_rx) {
				capi_free(tmp_tx);
				capi_free(tmp_rx);
				ret = -ENOMEM;
				goto cs_deassert;
			}
			memcpy(tmp_tx, transfer->tx_buf, transfer->tx_size);
			hal_ret = HAL_SPI_TransmitReceive(priv_handle->hspi,
							  tmp_tx, tmp_rx,
							  xfer_len, timeout_val);
			if (hal_ret == HAL_OK)
				memcpy(transfer->rx_buf, tmp_rx, transfer->rx_size);
			capi_free(tmp_tx);
			capi_free(tmp_rx);
		}
	} else if (transfer->tx_buf) {
		hal_ret = HAL_SPI_Transmit(priv_handle->hspi,
					   (uint8_t *)transfer->tx_buf,
					   transfer->tx_size,
					   transfer->timeout > 0 ? transfer->timeout : HAL_MAX_DELAY);
	} else {
		uint8_t *zero_tx = capi_calloc(1, transfer->rx_size);

		if (!zero_tx) {
			ret = -ENOMEM;
			goto cs_deassert;
		}
		hal_ret = HAL_SPI_TransmitReceive(priv_handle->hspi,
						  zero_tx, transfer->rx_buf,
						  transfer->rx_size,
						  transfer->timeout > 0 ? transfer->timeout : HAL_MAX_DELAY);
		capi_free(zero_tx);
	}

	if (hal_ret != HAL_OK) {
		if (hal_ret == HAL_TIMEOUT)
			ret = -ETIMEDOUT;
		else
			ret = -EIO;
	}

cs_deassert:
	/* CS delay last */
	if (dev_extra && dev_extra->cs_delay_last) {
		capi_wait_us(dev_extra->cs_delay_last);
	}

	/* Deassert CS if requested (drive high for active-low CS) */
	if (deassert_cs && priv_handle->cs_initialized) {
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
	}

	/* CS change delay */
	if (dev_extra && dev_extra->cs_change_delay) {
		capi_wait_us(dev_extra->cs_change_delay);
	}

	return ret;
}

/**
 * @brief Perform a synchronous SPI transceive operation.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_transceive(struct capi_spi_device *device,
				     struct capi_spi_transfer *transfer)
{
	struct stm32_spi_priv_handle *priv_handle;
	int ret;

	if (!device || !device->controller || !transfer)
		return -EINVAL;

	priv_handle = device->controller->priv;

	/* Set up CS GPIO if needed */
	ret = setup_cs_gpio(priv_handle, device);
	if (ret)
		return ret;

	/* Perform the transfer with CS control */
	return perform_spi_transfer_with_cs(priv_handle, device, transfer, true, true);
}

/**
 * @brief Perform an asynchronous SPI transceive operation using interrupts.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @param timeout - Timeout value in milliseconds.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_transceive_async(struct capi_spi_device *device,
		struct capi_spi_transfer *transfer,
		int timeout)
{
	struct stm32_spi_priv_handle *priv_handle;
	struct stm32_spi_device_extra *dev_extra;
	HAL_StatusTypeDef hal_ret;
	int ret;

	if (!device || !device->controller || !transfer)
		return -EINVAL;

	priv_handle = device->controller->priv;
	dev_extra = device->extra;

	if (priv_handle->async_in_progress)
		return -EBUSY;

