analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
	/* Set up CS GPIO if needed */
	ret = setup_cs_gpio(priv_handle, device);
	if (ret)
		return ret;

	/* Configure SPI for this device */
	ret = stm32_capi_spi_config_peripheral(priv_handle, device);
	if (ret)
		return ret;

	priv_handle->current_transfer = transfer;
	priv_handle->async_in_progress = true;

	/* Assert CS (drive low for active-low CS) */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_LOW);

	/* CS delay first */
	if (dev_extra && dev_extra->cs_delay_first)
		capi_wait_us(dev_extra->cs_delay_first);

	if (transfer->tx_buf && transfer->rx_buf) {
		hal_ret = HAL_SPI_TransmitReceive_IT(priv_handle->hspi,
						     (uint8_t *)transfer->tx_buf,
						     transfer->rx_buf,
						     max(transfer->tx_size, transfer->rx_size));
	} else if (transfer->tx_buf) {
		hal_ret = HAL_SPI_Transmit_IT(priv_handle->hspi,
					      (uint8_t *)transfer->tx_buf,
					      transfer->tx_size);
	} else if (transfer->rx_buf) {
		hal_ret = HAL_SPI_Receive_IT(priv_handle->hspi,
					     transfer->rx_buf,
					     transfer->rx_size);
	} else {
		priv_handle->async_in_progress = false;
		/* Deassert CS on error */
		if (priv_handle->cs_initialized)
			capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
		return -EINVAL;
	}

	if (hal_ret != HAL_OK) {
		priv_handle->async_in_progress = false;
		priv_handle->current_transfer = NULL;
		/* Deassert CS on error */
		if (priv_handle->cs_initialized)
			capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
		switch (hal_ret) {
		case HAL_BUSY:
			return -EBUSY;
		case HAL_ERROR:
			return -EIO;
		default:
			return -EIO;
		}
	}

	return 0;
}

/**
 * @brief Perform a synchronous SPI read command (TX then RX).
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_read_command(struct capi_spi_device *device,
				       struct capi_spi_transfer *transfer)
{
	struct stm32_spi_priv_handle *priv_handle;
	struct stm32_spi_device_extra *dev_extra;
	HAL_StatusTypeDef hal_ret;
	int ret = 0;

	if (!device || !device->controller || !transfer)
		return -EINVAL;

	priv_handle = device->controller->priv;
	dev_extra = device->extra;

	/* Set up CS GPIO if needed */
	ret = setup_cs_gpio(priv_handle, device);
	if (ret)
		return ret;

	/* Configure SPI for this device */
	ret = stm32_capi_spi_config_peripheral(priv_handle, device);
	if (ret)
		return ret;

	/* Assert CS (drive low for active-low CS) */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_LOW);

	/* CS delay first */
	if (dev_extra && dev_extra->cs_delay_first)
		capi_wait_us(dev_extra->cs_delay_first);

	/* First transmit command/address */
	if (transfer->tx_buf && transfer->tx_size > 0) {
		hal_ret = HAL_SPI_Transmit(priv_handle->hspi,
					   (uint8_t *)transfer->tx_buf,
					   transfer->tx_size,
					   transfer->timeout > 0 ? transfer->timeout : HAL_MAX_DELAY);
		if (hal_ret != HAL_OK) {
			switch (hal_ret) {
			case HAL_BUSY:
				ret = -EBUSY;
				break;
			case HAL_TIMEOUT:
				ret = -ETIMEDOUT;
				break;
			default:
				ret = -EIO;
				break;
			}
			goto deassert_cs;
		}
	}

	/* Then receive data */
	if (transfer->rx_buf && transfer->rx_size > 0) {
		/*
		 * In master + 2-line mode HAL_SPI_Receive() redirects to
		 * HAL_SPI_TransmitReceive(hspi, rx_buf, rx_buf, ...): it clocks
		 * the RX buffer's *current* contents out on MOSI. Zero it first
		 * so we clock defined 0x00 dummy bytes (never the caller's stale
		 * data) during the read phase.
		 */
		memset(transfer->rx_buf, 0, transfer->rx_size);
		hal_ret = HAL_SPI_Receive(priv_handle->hspi,
					  transfer->rx_buf,
					  transfer->rx_size,
					  transfer->timeout > 0 ? transfer->timeout : HAL_MAX_DELAY);
		switch (hal_ret) {
		case HAL_OK:
			break;
		case HAL_BUSY:
			ret = -EBUSY;
			break;
		case HAL_TIMEOUT:
			ret = -ETIMEDOUT;
			break;
		default:
			ret = -EIO;
			break;
		}
	}

deassert_cs:
	/* CS delay last */
	if (dev_extra && dev_extra->cs_delay_last)
		capi_wait_us(dev_extra->cs_delay_last);

	/* Deassert CS (drive high for active-low CS) */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);

	/* CS change delay */
	if (dev_extra && dev_extra->cs_change_delay)
		capi_wait_us(dev_extra->cs_change_delay);

	return ret;
}

/**
 * @brief Perform an asynchronous SPI read command using interrupts.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_read_command_async(struct capi_spi_device *device,
		struct capi_spi_transfer *transfer)
{
	struct stm32_spi_priv_handle *priv_handle;
	struct stm32_spi_device_extra *dev_extra;
	HAL_StatusTypeDef hal_ret;
	int ret;

	if (!device || !device->controller || !transfer)
		return -EINVAL;

	priv_handle = device->controller->priv;
	dev_extra = device->extra;

	if (priv_handle->async_in_progress)
		return -EBUSY;

	/* Set up CS GPIO if needed */
	ret = setup_cs_gpio(priv_handle, device);
	if (ret)
		return ret;

	/* Configure SPI for this device */
	ret = stm32_capi_spi_config_peripheral(priv_handle, device);
	if (ret)
		return ret;

	priv_handle->current_transfer = transfer;
	priv_handle->async_in_progress = true;

	/* Assert CS (drive low for active-low CS) */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_LOW);

	/* CS delay first */
	if (dev_extra && dev_extra->cs_delay_first)
		capi_wait_us(dev_extra->cs_delay_first);

	if (transfer->tx_buf && transfer->tx_size > 0) {
		hal_ret = HAL_SPI_Transmit_IT(priv_handle->hspi,
					      (uint8_t *)transfer->tx_buf,
					      transfer->tx_size);
	} else if (transfer->rx_buf && transfer->rx_size > 0) {
		hal_ret = HAL_SPI_Receive_IT(priv_handle->hspi,
					     transfer->rx_buf,
					     transfer->rx_size);
	} else {
		priv_handle->async_in_progress = false;
		/* Deassert CS on error */
		if (priv_handle->cs_initialized)
			capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
		return -EINVAL;
	}

	if (hal_ret != HAL_OK) {
		priv_handle->async_in_progress = false;
		priv_handle->current_transfer = NULL;
		/* Deassert CS on error */
		if (priv_handle->cs_initialized)
			capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
		switch (hal_ret) {
		case HAL_BUSY:
			return -EBUSY;
		case HAL_ERROR:
			return -EIO;
		default:
			return -EIO;
		}
	}

