analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
	return 0;
}

/**
 * @brief Tear down an in-flight IT transfer without relying on the SPI ISR.
 *
 * Both HAL_SPI_Abort() and HAL_SPI_Abort_IT() busy-wait for the abort ISR
 * (SPI_AbortTx_ISR / SPI_AbortRx_ISR, driven from HAL_SPI_IRQHandler) to move
 * the handle to HAL_SPI_STATE_ABORT. When the caller has masked global
 * interrupts that ISR never runs, so both HAL paths time out and fail. This
 * does the equivalent unwind synchronously at the register level: mask the SPI
 * interrupt sources, disable the peripheral, clear residual error flags and
 * reset the HAL transfer state machine back to READY.
 *
 * @param hspi - Pointer to the HAL SPI handle to abort.
 */
static void stm32_capi_spi_abort_hw(SPI_HandleTypeDef *hspi)
{
	/* Mask every SPI interrupt source so no ISR is needed to unwind. */
#if defined(SPI_CR2_TXEIE)
	/* Classic SPI IP: interrupt enables live in CR2. */
	CLEAR_BIT(hspi->Instance->CR2,
		  SPI_CR2_TXEIE | SPI_CR2_RXNEIE | SPI_CR2_ERRIE);
#else
	/* Newer SPI IP (H7/H5/...): interrupt enables live in IER. */
	hspi->Instance->IER = 0U;
#endif

	/* Disable the peripheral and clear any residual error flags. */
	__HAL_SPI_DISABLE(hspi);
	__HAL_SPI_CLEAR_OVRFLAG(hspi);
	__HAL_SPI_CLEAR_FREFLAG(hspi);

	/* Reset the HAL transfer state machine by hand. */
	hspi->TxISR = NULL;
	hspi->RxISR = NULL;
	hspi->pTxBuffPtr = NULL;
	hspi->pRxBuffPtr = NULL;
	hspi->TxXferCount = 0U;
	hspi->RxXferCount = 0U;
	hspi->ErrorCode = HAL_SPI_ERROR_NONE;
	hspi->State = HAL_SPI_STATE_READY;
}

/**
 * @brief Abort an ongoing asynchronous SPI operation.
 * @param device - Pointer to the SPI device descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_abort_async(struct capi_spi_device *device)
{
	struct stm32_spi_priv_handle *priv_handle;
	int ret = 0;

	if (!device || !device->controller)
		return -EINVAL;

	priv_handle = device->controller->priv;

	if (!priv_handle->async_in_progress)
		return 0;

	/* Abort DMA transfers if they are active */
	if (priv_handle->dma_handle && (priv_handle->rxdma_ch
					|| priv_handle->txdma_ch)) {
		ret = stm32_capi_spi_dma_abort(device);
		if (ret)
			return ret;
	}

	/*
	 * Tear the transfer down synchronously at the register level rather
	 * than via HAL_SPI_Abort[_IT]() — both of those busy-wait for the abort
	 * ISR, which cannot run when the caller has masked global interrupts
	 * (as the abort test does). This unwind does not drive HAL's
	 * AbortCpltCallback, so deassert CS and fire the terminal callback here.
	 */
	stm32_capi_spi_abort_hw(priv_handle->hspi);

	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select,
					    CAPI_GPIO_HIGH);
	priv_handle->async_in_progress = false;
	priv_handle->current_transfer = NULL;

	if (priv_handle->callback)
		priv_handle->callback(CAPI_SPI_EVENT_ERROR,
				      priv_handle->callback_arg, 0);

	return 0;
}

/**
 * @brief Register a callback for SPI events.
 * @param handle - Pointer to the SPI controller handle.
 * @param callback - Callback function to register.
 * @param callback_arg - User context passed to the callback.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_register_callback(struct capi_spi_controller_handle
		*handle,
		capi_spi_callback_t const callback,
		void *callback_arg)
{
	struct stm32_spi_priv_handle *priv_handle;

	if (!handle)
		return -EINVAL;

	priv_handle = handle->priv;
	priv_handle->callback = callback;
	priv_handle->callback_arg = callback_arg;

	return 0;
}

/**
 * @brief Manually control the chip select line.
 * @param device - Pointer to the SPI device descriptor.
 * @param cs_control - CS control mode (auto, assert, deassert).
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_set_cs(struct capi_spi_device *device,
				 enum capi_spi_cs_control cs_control)
{
	struct stm32_spi_priv_handle *priv_handle;

	if (!device || !device->controller)
		return -EINVAL;

	priv_handle = device->controller->priv;

	switch (cs_control) {
	case CAPI_SPI_CS_AUTO:
		/* HAL handles CS automatically - nothing to do */
		break;
	case CAPI_SPI_CS_MANUAL_ASSERT:
		/*
		 * With a GPIO CS, assert it (drive low for active-low CS).
		 * With native CS (no GPIO CS configured), soft-NSS master mode
		 * has no externally-driven CS line to hold, so manual assert is
		 * a harmless no-op that still reports success.
		 */
		if (priv_handle->cs_initialized)
			capi_gpio_pin_set_raw_value(&priv_handle->chip_select,
						    CAPI_GPIO_LOW);
		break;
	case CAPI_SPI_CS_MANUAL_DEASSERT:
		/* Deassert GPIO CS (drive high for active-low CS); no-op for
		 * native CS - see CAPI_SPI_CS_MANUAL_ASSERT above. */
		if (priv_handle->cs_initialized)
			capi_gpio_pin_set_raw_value(&priv_handle->chip_select,
						    CAPI_GPIO_HIGH);
		break;
	default:
		return -EINVAL;
	}

	return 0;
}

/**
 * @brief SPI interrupt service routine handler.
 * @param handle - Pointer to the SPI controller handle.
 */
static void stm32_capi_spi_isr(void *handle)
{
	struct capi_spi_controller_handle *controller_handle = (struct
			capi_spi_controller_handle *)handle;
	struct stm32_spi_priv_handle *priv_handle;

	if (!controller_handle)
		return;

	priv_handle = controller_handle->priv;
	HAL_SPI_IRQHandler(priv_handle->hspi);
}

/**
 * @brief Transfer multiple SPI messages in sequence.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfers - Array of transfer descriptors.
 * @param transfer_count - Number of transfers.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_capi_spi_transfer_multiple(struct capi_spi_device *device,
				     struct capi_spi_transfer *transfers,
				     uint32_t transfer_count)
{
	struct stm32_spi_priv_handle *priv_handle;
	int ret;

	if (!device || !device->controller || !transfers || !transfer_count)
		return -EINVAL;

	priv_handle = device->controller->priv;

	/* Set up CS GPIO if needed */
	ret = setup_cs_gpio(priv_handle, device);
	if (ret)
		return ret;

	for (uint32_t i = 0; i < transfer_count; i++) {
		bool assert_cs = (i == 0);
		bool deassert_cs = (i == transfer_count - 1);

