analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
		ret = perform_spi_transfer_with_cs(priv_handle, device, &transfers[i],
						   assert_cs, deassert_cs);
		if (ret)
			return ret;
	}

	return 0;
}

/**
 * @brief Enable or disable alternate function mode for the CS pin.
 * @param device - Pointer to the SPI device descriptor.
 * @param enable - true for alternate function, false for GPIO mode.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_capi_spi_alternate_cs_enable(struct capi_spi_device *device,
				       bool enable)
{
	struct stm32_spi_priv_handle *priv_handle;
	struct stm32_capi_gpio_port_priv *gpio_priv;
	struct stm32_spi_device_extra *dev_extra;
	GPIO_InitTypeDef gpio_config;
	int ret;

	if (!device || !device->controller)
		return -EINVAL;

	priv_handle = device->controller->priv;
	dev_extra = device->extra;

	if (!priv_handle->cs_initialized)
		return -ENOSYS;

	if (!dev_extra)
		return -EINVAL;

	/* Get GPIO port private data for direct HAL access */
	gpio_priv = priv_handle->cs_port_handle->priv;

	/* Configure GPIO for alternate function or regular output */
	gpio_config.Pin = (1 << (priv_handle->chip_select.number));
	gpio_config.Pull = GPIO_NOPULL;
	gpio_config.Speed = GPIO_SPEED_FREQ_LOW;

	if (enable) {
		gpio_config.Mode = GPIO_MODE_AF_PP;
		gpio_config.Alternate = priv_handle->alternate;
	} else {
		gpio_config.Mode = GPIO_MODE_OUTPUT_PP;
		gpio_config.Alternate = 0;
	}

	HAL_GPIO_Init(gpio_priv->port, &gpio_config);

	/* Set CS high (inactive) when in GPIO mode */
	if (!enable) {
		ret = capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
		if (ret)
			return ret;
	}

	return 0;
}

/**
 * @brief DMA completion callback for SPI transfers.
 * @param event - DMA event identifier.
 * @param ctx - User context (pointer to the SPI device).
 */
static void stm32_capi_spi_dma_callback(uint32_t event, void *ctx)
{
	struct capi_spi_device *device = (struct capi_spi_device *)ctx;
	struct stm32_spi_priv_handle *priv_handle = device->controller->priv;

	/* if more xfers pending dont do anything */
	if (priv_handle->current_transfer_index < priv_handle->transfer_count - 1)
		return;

#ifdef HAL_TIM_MODULE_ENABLED
	if (priv_handle->cs_timer)
		capi_timer_channel_disable(priv_handle->cs_timer,
					   priv_handle->cs_timer_channel);

	if (priv_handle->tx_timer)
		capi_timer_channel_disable(priv_handle->tx_timer,
					   priv_handle->tx_timer_channel);
#endif

	/* Perform abort SPI transfers */
	stm32_capi_spi_abort_async(device);

	priv_handle->dma_done = true;

	if (priv_handle->dma_user_cb)
		priv_handle->dma_user_cb(priv_handle->dma_user_ctx);
}

/**
 * @brief Configure and start DMA transfers.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfers - Array of transfer descriptors.
 * @param transfer_count - Number of transfers.
 * @param completion_callback - Callback invoked on DMA completion.
 * @param callback_ctx - User context passed to the callback.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_config_dma_and_start(struct capi_spi_device *device,
		struct capi_spi_transfer *transfers,
		uint32_t transfer_count,
		capi_dma_xfer_complete_cb completion_callback,
		void *callback_ctx)
{
	struct stm32_spi_priv_handle *priv_handle = device->controller->priv;
	struct capi_dma_transfer *rx_ch_xfer;
	struct capi_dma_transfer *tx_ch_xfer;
	SPI_TypeDef *SPIx = priv_handle->hspi->Instance;
	int ret;
	uint32_t i;

	if (!device || !transfers || !priv_handle->dma_handle)
		return -EINVAL;

	if (!priv_handle->rxdma_ch || !priv_handle->txdma_ch)
		return -EINVAL;

	rx_ch_xfer = capi_calloc(transfer_count, sizeof(*rx_ch_xfer));
	if (!rx_ch_xfer)
		return -ENOMEM;

	tx_ch_xfer = capi_calloc(transfer_count, sizeof(*tx_ch_xfer));
	if (!tx_ch_xfer) {
		ret = -ENOMEM;
		goto free_rx_ch_xfer;
	}

	for (i = 0; i < transfer_count; i++) {
		/* Configure TX DMA transfer */
		tx_ch_xfer[i].src = (capi_dma_glbl_addr_t)transfers[i].tx_buf;
#ifndef SPI_SR_TXE
		tx_ch_xfer[i].dst = (capi_dma_glbl_addr_t) & (SPIx->TXDR);
#else
		tx_ch_xfer[i].dst = (capi_dma_glbl_addr_t) & (SPIx->DR);
#endif
		tx_ch_xfer[i].xfer_type = CAPI_DMA_MEM_TO_DEV;
		tx_ch_xfer[i].src_inc = CAPI_DMA_BYTE_INCREMENT;
		tx_ch_xfer[i].dst_inc = CAPI_DMA_NO_INCREMENT;
		tx_ch_xfer[i].length = transfers[i].tx_size;

		/* Configure RX DMA transfer */
		rx_ch_xfer[i].dst = (capi_dma_glbl_addr_t)transfers[i].rx_buf;
#ifndef SPI_SR_RXNE
		rx_ch_xfer[i].src = (capi_dma_glbl_addr_t) & (SPIx->RXDR);
#else
		rx_ch_xfer[i].src = (capi_dma_glbl_addr_t) & (SPIx->DR);
#endif
		rx_ch_xfer[i].xfer_type = CAPI_DMA_DEV_TO_MEM;
		rx_ch_xfer[i].src_inc = CAPI_DMA_NO_INCREMENT;
		rx_ch_xfer[i].dst_inc = CAPI_DMA_BYTE_INCREMENT;
		rx_ch_xfer[i].length = transfers[i].rx_size;
	}

	priv_handle->tx_ch_xfer = tx_ch_xfer;
	priv_handle->rx_ch_xfer = rx_ch_xfer;
	priv_handle->transfer_count = transfer_count;
	priv_handle->current_transfer_index = 0;

	/* Register completion callback on the RX DMA channel */
	if (completion_callback) {
		ret = capi_dma_register_complete_callback(priv_handle->rxdma_ch,
				completion_callback,
				callback_ctx);
		if (ret)
			goto cleanup_dma;
	}

	/* Configure RX DMA channel */
	ret = capi_dma_config_xfer(priv_handle->rxdma_ch, &rx_ch_xfer[0]);
	if (ret)
		goto cleanup_dma;

	/* Configure TX DMA channel */
	ret = capi_dma_config_xfer(priv_handle->txdma_ch, &tx_ch_xfer[0]);
	if (ret)
		goto cleanup_dma;

	/* Start TX DMA transfer */
	ret = capi_dma_xfer_start(priv_handle->txdma_ch);
	if (ret)
		goto abort_transfer;

	/* Start RX DMA transfer */
	ret = capi_dma_xfer_start(priv_handle->rxdma_ch);
	if (ret)
		goto abort_transfer;

	/* Enable SPI DMA requests */
	if (priv_handle->txdma_ch) {
#if defined (STM32H5)
		SET_BIT(priv_handle->hspi->Instance->CFG1, SPI_CFG1_TXDMAEN);
#else
		SET_BIT(priv_handle->hspi->Instance->CR2, SPI_CR2_TXDMAEN);
#endif
	}

	if (priv_handle->rxdma_ch) {
#if defined (STM32H5)
		SET_BIT(priv_handle->hspi->Instance->CFG1, SPI_CFG1_RXDMAEN);
#else
		SET_BIT(priv_handle->hspi->Instance->CR2, SPI_CR2_RXDMAEN);
#endif
	}

