analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
#ifdef HAL_TIM_MODULE_ENABLED
	if (priv_handle->cs_timer) {
		stm32_capi_spi_alternate_cs_enable(device, true);
		ret = capi_timer_channel_enable(priv_handle->cs_timer,
						priv_handle->cs_timer_channel);
		if (ret)
			goto abort_transfer;
		ret = capi_timer_start(priv_handle->cs_timer);
		if (ret)
			goto abort_transfer;
	}
	if (priv_handle->tx_timer) {
		ret = capi_timer_channel_enable(priv_handle->tx_timer,
						priv_handle->tx_timer_channel);
		if (ret)
			goto abort_transfer;
		ret = capi_timer_start(priv_handle->tx_timer);
		if (ret)
			goto abort_transfer;
	}
#endif

	return 0;

abort_transfer:
	capi_dma_xfer_abort(priv_handle->txdma_ch);
	capi_dma_xfer_abort(priv_handle->rxdma_ch);
cleanup_dma:
	capi_free(tx_ch_xfer);
	priv_handle->tx_ch_xfer = NULL;
free_rx_ch_xfer:
	capi_free(rx_ch_xfer);
	priv_handle->rx_ch_xfer = NULL;
	return ret;
}

/**
 * @brief Abort DMA transfers and free associated resources.
 * @param device - Pointer to the SPI device descriptor.
 * @return 0 on success, negative error code otherwise.
 */
static int stm32_capi_spi_dma_abort(struct capi_spi_device *device)
{
	struct stm32_spi_priv_handle *priv_handle;
	SPI_TypeDef *SPIx;
	int ret = 0;

	if (!device || !device->controller)
		return -EINVAL;

	priv_handle = device->controller->priv;
	if (!priv_handle)
		return -EINVAL;

	SPIx = priv_handle->hspi->Instance;

	if (priv_handle->rxdma_ch) {
		ret = capi_dma_xfer_abort(priv_handle->rxdma_ch);
		if (ret)
			return ret;

#if defined (STM32H5)
		CLEAR_BIT(SPIx->CFG1, SPI_CFG1_RXDMAEN);
#else
		CLEAR_BIT(SPIx->CR2, SPI_CR2_RXDMAEN);
#endif
	}

	if (priv_handle->txdma_ch) {
		ret = capi_dma_xfer_abort(priv_handle->txdma_ch);
		if (ret)
			return ret;

#if defined (STM32H5)
		CLEAR_BIT(SPIx->CFG1, SPI_CFG1_TXDMAEN);
#else
		CLEAR_BIT(SPIx->CR2, SPI_CR2_TXDMAEN);
#endif
	}

	/* Dummy read to clear any pending read on SPI */
#ifndef SPI_SR_RXNE
	*(volatile uint8_t *)&SPIx->RXDR;
#else
	*(volatile uint8_t *)&SPIx->DR;
#endif

	/* Free the allocated memory for tx and rx transfers */
	capi_free(priv_handle->tx_ch_xfer);
	capi_free(priv_handle->rx_ch_xfer);
	priv_handle->tx_ch_xfer = NULL;
	priv_handle->rx_ch_xfer = NULL;

	/* put CS pin back into gpio mode */
	stm32_capi_spi_alternate_cs_enable(device, false);

	return 0;
}

/**
 * @brief Perform an asynchronous single DMA transfer.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @param callback - Completion callback.
 * @param callback_arg - Callback argument.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_capi_spi_transfer_dma_async(struct capi_spi_device *device,
				      struct capi_spi_transfer *transfer,
				      void (*callback)(void*),
				      void* callback_arg)
{
	return stm32_capi_spi_transfer_multiple_dma_async(device, transfer, 1, callback,
			callback_arg);
}

/**
 * @brief Perform a synchronous single DMA transfer.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfer - Pointer to the transfer descriptor.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_capi_spi_transfer_dma(struct capi_spi_device *device,
				struct capi_spi_transfer *transfer)
{
	return stm32_capi_spi_transfer_multiple_dma(device, transfer, 1);
}

/**
 * @brief Perform an asynchronous multi-transfer DMA operation.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfers - Array of transfer descriptors.
 * @param transfer_count - Number of transfers.
 * @param callback - Completion callback.
 * @param callback_arg - Callback argument.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_capi_spi_transfer_multiple_dma_async(struct capi_spi_device *device,
		struct capi_spi_transfer *transfers,
		uint32_t transfer_count,
		void (*callback)(void*),
		void* callback_arg)
{
	struct stm32_spi_priv_handle *priv_handle;

	if (!device || !device->controller || !transfers || !transfer_count)
		return -EINVAL;

	priv_handle = device->controller->priv;

	priv_handle->dma_user_cb = callback;
	priv_handle->dma_user_ctx = callback_arg;

	return stm32_capi_config_dma_and_start(device, transfers, transfer_count,
					       stm32_capi_spi_dma_callback, device);
}

/**
 * @brief Perform a synchronous multi-transfer DMA operation.
 * @param device - Pointer to the SPI device descriptor.
 * @param transfers - Array of transfer descriptors.
 * @param transfer_count - Number of transfers.
 * @return 0 on success, negative error code otherwise.
 */
int stm32_capi_spi_transfer_multiple_dma(struct capi_spi_device *device,
		struct capi_spi_transfer *transfers,
		uint32_t transfer_count)
{
	struct stm32_spi_priv_handle *priv_handle;
	uint32_t timeout;
	int ret;

	if (!device || !device->controller || !transfers || !transfer_count)
		return -EINVAL;

	priv_handle = device->controller->priv;

	priv_handle->dma_done = false;
	ret = stm32_capi_config_dma_and_start(device, transfers, transfer_count,
					      stm32_capi_spi_dma_callback, device);
	if (ret)
		return ret;

	/* Wait for completion with timeout */
	timeout = transfers[0].tx_size + transfers[0].rx_size;
	if (timeout == 0)
		timeout = STM32_SPI_DMA_DEFAULT_TIMEOUT_MS;

	while (timeout) {
		timeout--;
		capi_wait_ms(1);
		if (priv_handle->dma_done)
			break;
	}

	if (!timeout) {
		stm32_capi_spi_dma_abort(device);
		return -ETIMEDOUT;
	}

	return 0;
}

const struct capi_spi_ops stm32_capi_spi_ops = {
	.init = stm32_capi_spi_init,
	.deinit = stm32_capi_spi_deinit,
	.transceive = stm32_capi_spi_transceive,
	.transceive_async = stm32_capi_spi_transceive_async,
	.read_command = stm32_capi_spi_read_command,
	.read_command_async = stm32_capi_spi_read_command_async,
	.abort_async = stm32_capi_spi_abort_async,
	.register_callback = stm32_capi_spi_register_callback,
	.set_cs = stm32_capi_spi_set_cs,
	.isr = stm32_capi_spi_isr,
};

const struct stm32_capi_spi_extended_ops stm32_capi_spi_extended_ops = {
	.base_ops = {
		.init = stm32_capi_spi_init,
		.deinit = stm32_capi_spi_deinit,
		.transceive = stm32_capi_spi_transceive,
		.transceive_async = stm32_capi_spi_transceive_async,
		.read_command = stm32_capi_spi_read_command,
		.read_command_async = stm32_capi_spi_read_command_async,
		.abort_async = stm32_capi_spi_abort_async,
		.register_callback = stm32_capi_spi_register_callback,
		.set_cs = stm32_capi_spi_set_cs,
		.isr = stm32_capi_spi_isr,
	},
	.transfer_dma = stm32_capi_spi_transfer_dma,
	.transfer_dma_async = stm32_capi_spi_transfer_dma_async,
	.transfer_multiple_dma = stm32_capi_spi_transfer_multiple_dma,
	.transfer_multiple_dma_async = stm32_capi_spi_transfer_multiple_dma_async,
	.alternate_cs_enable = stm32_capi_spi_alternate_cs_enable,
};

/**
 * @brief HAL SPI TX complete callback.
 * @param hspi - Pointer to the HAL SPI handle.
 */
void HAL_SPI_TxCpltCallback(SPI_HandleTypeDef *hspi)
{
	struct stm32_spi_priv_handle *priv_handle;
	struct capi_spi_transfer *transfer;

	priv_handle = find_priv_handle(hspi);
	if (!priv_handle) {
		return;
	}

	transfer = priv_handle->current_transfer;

	/* For read command async, check if we need to start RX phase */
	if (transfer && transfer->rx_buf && transfer->rx_size > 0
	    && transfer->tx_size > 0) {
		/*
		 * Start RX phase for read command. HAL_SPI_Receive_IT() in
		 * master + 2-line mode redirects to TransmitReceive_IT(rx, rx),
		 * clocking the RX buffer's current contents out on MOSI; zero it
		 * first so defined 0x00 dummy bytes are clocked, not stale data.
		 */
		HAL_StatusTypeDef hal_ret;
		memset(transfer->rx_buf, 0, transfer->rx_size);
		hal_ret = HAL_SPI_Receive_IT(hspi, transfer->rx_buf,
					     transfer->rx_size);
		if (hal_ret != HAL_OK) {
			/* Error in RX phase - deassert CS */
			if (priv_handle->cs_initialized)
				capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);
			priv_handle->async_in_progress = false;
			priv_handle->current_transfer = NULL;
			if (priv_handle->callback) {
				priv_handle->callback(CAPI_SPI_EVENT_ERROR,
						      priv_handle->callback_arg,
						      -EIO);
			}
		}
		return;
	}

	/* TX complete - deassert CS */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);

	priv_handle->async_in_progress = false;
	priv_handle->current_transfer = NULL;

