analogdevicesinc/no-OS/capi/platform/stm32/stm32_capi_spi.c
	if (priv_handle->callback) {
		priv_handle->callback(CAPI_SPI_EVENT_XFR_DONE,
				      priv_handle->callback_arg,
				      0);
	}
}

/**
 * @brief HAL SPI RX complete callback.
 * @param hspi - Pointer to the HAL SPI handle.
 */
void HAL_SPI_RxCpltCallback(SPI_HandleTypeDef *hspi)
{
	struct stm32_spi_priv_handle *priv_handle;

	priv_handle = find_priv_handle(hspi);
	if (!priv_handle) {
		return;
	}

	/* RX complete - deassert CS */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);

	priv_handle->async_in_progress = false;
	priv_handle->current_transfer = NULL;

	if (priv_handle->callback) {
		priv_handle->callback(CAPI_SPI_EVENT_XFR_DONE,
				      priv_handle->callback_arg,
				      0);
	}
}

/**
 * @brief HAL SPI TX/RX complete callback.
 * @param hspi - Pointer to the HAL SPI handle.
 */
void HAL_SPI_TxRxCpltCallback(SPI_HandleTypeDef *hspi)
{
	struct stm32_spi_priv_handle *priv_handle;

	priv_handle = find_priv_handle(hspi);
	if (!priv_handle) {
		return;
	}

	/* TxRx complete - deassert CS */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);

	priv_handle->async_in_progress = false;
	priv_handle->current_transfer = NULL;

	if (priv_handle->callback) {
		priv_handle->callback(CAPI_SPI_EVENT_XFR_DONE,
				      priv_handle->callback_arg,
				      0);
	}
}

/**
 * @brief HAL SPI error callback.
 * @param hspi - Pointer to the HAL SPI handle.
 */
void HAL_SPI_ErrorCallback(SPI_HandleTypeDef *hspi)
{
	struct stm32_spi_priv_handle *priv_handle;

	priv_handle = find_priv_handle(hspi);
	if (!priv_handle) {
		return;
	}

	/* Error - deassert CS */
	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);

	priv_handle->async_in_progress = false;
	priv_handle->current_transfer = NULL;

	if (priv_handle->callback) {
		priv_handle->callback(CAPI_SPI_EVENT_ERROR,
				      priv_handle->callback_arg,
				      -EIO);
	}
}

/**
 * @brief HAL SPI abort complete callback.
 * @param hspi - Pointer to the HAL SPI handle.
 */
void HAL_SPI_AbortCpltCallback(SPI_HandleTypeDef *hspi)
{
	struct stm32_spi_priv_handle *priv_handle;

	priv_handle = find_priv_handle(hspi);
	if (!priv_handle)
		return;

	if (priv_handle->cs_initialized)
		capi_gpio_pin_set_raw_value(&priv_handle->chip_select, CAPI_GPIO_HIGH);

	priv_handle->async_in_progress = false;
	priv_handle->current_transfer = NULL;

	if (priv_handle->callback)
		priv_handle->callback(CAPI_SPI_EVENT_ERROR,
				      priv_handle->callback_arg, 0);
}